blog/blog/app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 2]]
---
	<div class="row blue-grey lighten-3 block-post">
	<%= @post.comments.count %> comments