blog/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Internship"], ["content", "Learning Rails"], ["created_at", "2016-02-24 20:21:13.062257"], ["updated_at", "2016-02-24 20:21:13.062257"]]
---
  def create
    @post = Post.new(post_params)
    respond_to do |format|
      if @post.save