blog/blog/app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "comments" ("username", "comment", "created_at", "updated_at", "user_id", "post_id") VALUES (?, ?, ?, ?, ?, ?)  [["username", "Lucas"], ["comment", "dfadfa"], ["created_at", "2022-03-02 02:07:23.392534"], ["updated_at", "2022-03-02 02:07:23.392534"], ["user_id", 1], ["post_id", 2]]
---
  def create
  	if current_user
	  	@post = Post.find(params[:post_id])
	  	@comment = @post.comments.new(comment_params)
	  	@comment.user_id = current_user.id
      if @comment.save