blog/blog/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    binding.pry
    @post.user_id = current_user.id
    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "post", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "eaefafe"], ["post", "gaeaggaa"], ["user_id", 1], ["created_at", "2022-03-02 02:07:32.546851"], ["updated_at", "2022-03-02 02:07:32.546851"]]